soaplab/src/xml-ref/type.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"> 
 <env:Header>
  <liq:Header xmlns:liq="http://savonet.sf.net/ns/message-type" 
      env:role="http://www.w3.org/2003/05/soap-envelope/role/next"
      env:mustUnderstand="true">
   <liq:message-type>
    <liq:content-type>application/xspf+xml</liq:content-type>
    <liq:role>http://savonet.sf.net/message/role/categories-list</liq:role>
   </liq:message-type>
   <liq:dateTime>2007-07-12T00:24:41.169+02:00</liq:dateTime>
   <liq:sender>
    <liq:server>eratosthene</liq:server>
   </liq:sender>
  </liq:Header>
 </env:Header>
 <env:Body>
  <xspf:playlist xspf:version="1" xmlns:xspf="http://xspf.org/ns/0/">
   <xspf:trackList>
    <xspf:track>
     <xspf:title>Golds</xspf:title>
     <xspf:location>category.xml</xspf:location>
    </xspf:track>
    <xspf:track>
     <xspf:title>90s</xspf:title>
     <xspf:location>category-2.xml</xspf:location>
    </xspf:track>
    <!-- ... -->
   </xspf:trackList>
  </xspf:playlist>
 </env:Body>
</env:Envelope>
